publish/logs/ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<!-- 2021-08-23 lun 16:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ideas y cosas tontas</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Galindo" />
<link rel="stylesheet" type="text/css" href="../style.css" />
<link rel="shortcut icon" type="image/jpg" href="../favicon.png"/>
<meta name="theme-color" content="#fff">
<meta name="viewport" content="width=device-width, initial-scale=1.0, maximum-scale=1.0, user-scalable=no"/>
<div id="google_translate_element"></div></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Ideas y cosas tontas
<br />
<span class="subtitle">Logs</span>
</h1>


<div id="outline-container-org9843d5d" class="outline-2">
<h2 id="org9843d5d">Bezos, Besus, be sus<sub> ඞ</sub></h2>
<div class="outline-text-2" id="text-org9843d5d">
</div>
<div id="outline-container-org17a9b21" class="outline-3">
<h3 id="org17a9b21"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-23 lun]</span></span></h3>
<div class="outline-text-3" id="text-org17a9b21">
<p>
Una cosa que aparentemente se ha vuelto popular entre los famosos de Silicon Valley es tratar de lazarse al espacio, por supuesto que hablo de Blue Origin y Spacex, ambas tienen razones muy diferentes para ir al espacio, aparentemente la visión de Spacex es ir al espacio por que si algo le pasa a la tierra podríamos mantener a la humanidad en otro lugar (marte quizá?) y por otro lado la empresa de Jeff Bezos Blue Origin que ve la tierra como un lugar único que tenemos que mantener y quiere sacar las operaciones industriales más pesadas de la tierra. <br />
</p>

<p>
Nunca pensé que estaría de acuerdo con Bezos en algo, aun así lo mas probable es que solo ayuden a un grupo de oligarcas a sacar sus operaciones mineras. No dudo ni un segundo en que lo único que se lograra será perpetuar más las fortunas de los grandes grupos mineros.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd47969d" class="outline-2">
<h2 id="orgd47969d">Blanco</h2>
<div class="outline-text-2" id="text-orgd47969d">
</div>
<div id="outline-container-org2fdf4ef" class="outline-3">
<h3 id="org2fdf4ef"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-17 mar]</span></span></h3>
<div class="outline-text-3" id="text-org2fdf4ef">
<p>
El color blanco es uno de los colores que personalmente no me gusta, pero como en estos días he tenido que añadir diagramas para poder explicar algunos temas&#x2026; Aun así no me doy por vencido, una de las cosas que más me gustan de mi sitio es la capacidad de poder cambiar el color del tema, me aburro muy rápido de un color así que cambiar el tema de color es de las pocas cosas que puedo hacer sin cargarme todo el sitio cada vez que quiera hacer un cambio, entonces he estado pensando que hacer para solucionarlo:
</p>
</div>

<div id="outline-container-org005db61" class="outline-4">
<h4 id="org005db61">El problema con los diagramas</h4>
<div class="outline-text-4" id="text-org005db61">
<p>
Mi plan original para el sitio era usar SVG para los diagramas y cambiarlos a voluntad con CSS puro, pero al estar haciendo experimentos con SVG me di cuenta de que es muy tardado hacer los diagramas de la manera que estaba pensando (además no los puedo agregar a LaTeX sin tener que exportar el SVG por separado) entonces no tengo mas alternativas que usar imágenes.
</p>
</div>
</div>

<div id="outline-container-org9794018" class="outline-4">
<h4 id="org9794018">-webkit-filter: invert(100%);</h4>
<div class="outline-text-4" id="text-org9794018">
<p>
Una solución que pensé es utilizar filtros de CSS esta solución me agrada mucho porque solo tengo modificar un poco mi código actual, sin embargo tiene unas limitaciones, solo puedo cambiar los colores por sus inversos por lo que tendría que limitar la cantidad de temas disponibles&#x2026;
</p>
</div>
</div>

<div id="outline-container-org1b25389" class="outline-4">
<h4 id="org1b25389">Pantalla de inicio</h4>
<div class="outline-text-4" id="text-org1b25389">
<p>
El tema del diseño de mi página es lo nuevo y lo viejo, me gustan mucho como los libro antiguos tienes muy pocas imágenes y solo se enfocan en explicar los procedimientos y yo quiero reflejar eso en mi página, aun así no quiero hacer una página que solo esté en blanco y negro, la idea que tengo es hacer una portada con las opciones del sitio que sirva como portada al sitio (sin contar que tiene el beneficio añadido de eliminar la necesidad de la página de "settings" que es un dolor en el trasero de mantener).
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org7ca30fb" class="outline-2">
<h2 id="org7ca30fb">Mi semstre</h2>
<div class="outline-text-2" id="text-org7ca30fb">
</div>
<div id="outline-container-orga657871" class="outline-3">
<h3 id="orga657871"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-14 sáb]</span></span></h3>
<div class="outline-text-3" id="text-orga657871">
<p>
Es mejor empezar desde cero que empezar de nuevo.
</p>
</div>
</div>
</div>

<div id="outline-container-orgfb9494d" class="outline-2">
<h2 id="orgfb9494d">Quote</h2>
<div class="outline-text-2" id="text-orgfb9494d">
</div>
<div id="outline-container-org74c0577" class="outline-3">
<h3 id="org74c0577"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-10 mar]</span></span></h3>
<div class="outline-text-3" id="text-org74c0577">
<blockquote>
<p>
“I love sleep. My life has the tendency to fall apart when I'm awake, you know?”
</p>

<p>
― Ernest Hemingway
</p>
</blockquote>
</div>
</div>
</div>

<div id="outline-container-orge70836c" class="outline-2">
<h2 id="orge70836c">123guestbook</h2>
<div class="outline-text-2" id="text-orge70836c">
</div>
<div id="outline-container-org9cb79af" class="outline-3">
<h3 id="org9cb79af"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-10 mar]</span></span></h3>
<div class="outline-text-3" id="text-org9cb79af">
<ul class="org-ul">
<li>Hago un guestbook.</li>
<li>Nadie lo usa por semanas.</li>
<li>Finalmente alguien escribe algo bonito.</li>
<li>123guestbook deja de funcionar</li>
<li>(ノ｀Д´)ノ彡┻━┻</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgfae19ad" class="outline-2">
<h2 id="orgfae19ad">Apuntes 2.0</h2>
<div class="outline-text-2" id="text-orgfae19ad">
</div>
<div id="outline-container-org1afdbb0" class="outline-3">
<h3 id="org1afdbb0"><span class="timestamp-wrapper"><span class="timestamp">[2021-08-05 jue]</span></span></h3>
<div class="outline-text-3" id="text-org1afdbb0">
<p>
Cuando empecé este sitio tenia en mente una sola idea, unir mis apuntes con los programas que hice durante el semestre, sin embargo en ese entonces no había encontrado ninguna herramienta que pudiera cumplir con mis requerimientos, los cuales eran:
</p>

<ul class="org-ul">
<li>Javascript</li>
<li>Ejecutarse en el frontend</li>
</ul>

<p>
Bueno ya encontré un herramienta que cumple con estas características. Por lo tanto voy a retomar esta idea (de todos modos reprobé calculo así que repasar mis notas no hará ningún daño).
</p>
</div>
</div>
</div>
</div>
</body>
</html>
